app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE (firstname LIKE '%1900%' OR lastname LIKE '%1900%' OR nationality LIKE '%1900%'  OR date_of_birth LIKE '%1900%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "authors"
---
  def index
    @tasks = if params[:toSearch]
      @authors = Author.search(params[:toSearch]).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "authors" ("firstname", "lastname", "nationality", "bio", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save