app/controllers/books_controller.rb

  def index
    @tasks = if params[:toSearch]
      @books = Book.search(params[:toSearch]).paginate(:page => params[:page], :per_page => 5)
---
SELECT  "books".* FROM "books" WHERE (title LIKE '%asd%' OR genre LIKE '%asd%' OR author LIKE '%asd%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"

  def new
    @book = Book.new
    @genres = Genre.all.order(:name)
    @authors = Author.all.order(:lastname)
---
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
SELECT "authors".* FROM "authors" ORDER BY "authors"."lastname" ASC

  def edit
    @genres = Genre.all.order(:name)
    @authors = Author.all.order(:lastname)
---
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
SELECT "authors".* FROM "authors" ORDER BY "authors"."lastname" ASC

  def create
    @book = Book.new(book_params)
    @genres = Genre.all.order(:name)
    @authors = Author.all.order(:lastname)

    respond_to do |format|
      if @book.save
---
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
SELECT "authors".* FROM "authors" ORDER BY "authors"."lastname" ASC
INSERT INTO "books" ("title", "year", "description", "genre_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Dkasjhjasdh"], ["year", 132], ["description", "dasda"], ["genre_id", 1], ["author_id", 1], ["created_at", "2018-05-16 16:04:24.839384"], ["updated_at", "2018-05-16 16:04:24.839384"]]

  def update
    @genres = Genre.all.order(:name)
    @authors = Author.all.order(:lastname)

    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "year" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["year", 1500], ["updated_at", "2018-05-16 17:25:56.694727"], ["id", 2]]