app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE (name LIKE '%Historical%') ORDER BY "genres"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"
---
  def index
    @tasks = if params[:toSearch]
      @genres = Genre.search(params[:toSearch]).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "genres" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Horror"], ["desc", "asjdalsjdklasjdlasjdlakjaskd"], ["created_at", "2018-05-16 12:27:59.492878"], ["updated_at", "2018-05-16 12:27:59.492878"]]
---
  def create
    @genre = Genre.new(genre_params)

    respond_to do |format|
      if @genre.save

DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
  def destroy
    @genre.destroy

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_genre
      @genre = Genre.find(params[:id])